public/man/man1/pw-jack.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - pw-jack.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - pw-jack.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>pw-jack - Use PipeWire instead of JACK</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>pw-jack</strong> [/options/] <em>COMMAND</em> [/ARGUMENTS…/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>pw-jack</strong> modifies the LD_LIBRARY_PATH environment variable so that
applications will load PipeWire&#39;s reimplementation of the JACK client
libraries instead of JACK&#39;s own libraries. This results in JACK clients
being redirected to PipeWire.</p>
<p>
If PipeWire&#39;s reimplementation of the JACK client libraries has been
installed as a system-wide replacement for JACK&#39;s own libraries, then
the whole system already behaves in that way, in which case <strong>pw-jack</strong>
has no practical effect.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-h</strong></p>
<blockquote>
<p>Show help.</p>
</blockquote>
<p>
<strong>-r NAME</strong></p>
<blockquote>
<p>The name of the remote instance to connect to. If left unspecified, a
connection is made to the default PipeWire instance.</p>
</blockquote>
<p>
<strong>-v</strong></p>
<blockquote>
<p>Verbose operation.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>pw-jack sndfile-jackplay /usr/share/sounds/freedesktop/stereo/bell.oga</strong></p>
<blockquote>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
AUTHORS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>The PipeWire Developers
&lt;<a href="https://gitlab.freedesktop.org/pipewire/pipewire/issues">https://gitlab.freedesktop.org/pipewire/pipewire/issues</a>&gt;; PipeWire is
available from &lt;<a href="https://pipewire.org">https://pipewire.org</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p><strong>pipewire(1)</strong>, <strong>jackd(1)</strong>,</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
